astb_relise/src/Reports/АХ_ОтчетРасхожденияОстаков/АХ_ОтчетРасхожденияОстаков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АХ_ОтчетРасхожденияОстаков</name>
</mdclass:Report>

astb_relise/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>ДискретностьРасчетаПроцентаИзноса</name>
    <type>
      <types>EnumRef.ДоступныеПериодыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм</name>
    <type>
      <types>EnumRef.ВидДополнительнойИнформацииПоНоменклатуре</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_0_0_0_3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_0_0_0_4</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_0_1_0_3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_0_0_1_2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_1_0_1_1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГруппыИЛИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьСрокНоскиВыданныхСИЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СверткаПотребностиПоНоменклатуреНормы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичнаяВыдача</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроцентИзноса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРабочиеМеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьКоличествоСтавокПоШтатномуРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьКоличествоЦикловЧисткиСИЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеЗначениеШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаАдресацииМестХраненияСИЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАлгоритмаФормированияПотребности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьДатуОкончанияСрокаНоскиНаЭтикетках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВнешнегоПользователя</name>
    <type>
      <types>EnumRef.ПредставлениеВнешнегоПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксШтрихкодаНоменклатуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьДоступСотрудникамКБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMSИнформированиеОВозвратеИзЧистки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSИнформированиеОПолученииСредствЗащиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSИнформированиеОПоступленииНаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSШаблонОВозвратеИзЧистки</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSШаблонОПолученииСредствЗащиты</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSШаблонОПоступленииНаСклад</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailИнформированиеОВозвратеИзЧистки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailИнформированиеОПолученииСредствЗащиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailИнформированиеОПоступленииНаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailШаблонОВозвратеИзЧистки</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailШаблонОПолученииСредствЗащиты</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailШаблонОПоступленииНаСклад</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОценкуСервисногоОбслуживания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбытаSAP</name>
    <type>
      <types>EnumRef.КаналыСбытаSAP</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходПраваСобственностиПоПредварительнойЗаявкеППС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеППСприКоллективнойВыдаче</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьВыдачуСверхНорм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьТолькоОсновныеУсловияНорм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоУмолчанию</name>
    <comment>Склад по-умолчанию для подстановки в документы</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеДляОбменаССАП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыЭкономическойДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Reports/АХ_ОтчетРасхожденияОстаков/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Получаем схему
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//...и настройки
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	//проверяем необходимые настройки
	
	// << Период
	ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если НЕ ПараметрПериод.Использование Тогда
		Период = Неопределено;
	Иначе
		Период = КонецДня(ПараметрПериод.Значение);
	КонецЕсли;
	// Период >>
	
	// << Организация
	ПараметрОрганизация = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если НЕ ПараметрОрганизация.Использование Тогда
		Организация = Неопределено;
	Иначе
		Организация = ПараметрОрганизация.Значение;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации") Тогда
		Организация = Справочники.Организации.ПустаяСсылка();		
	ИначеЕсли Организация = Неопределено ИЛИ Организация = Справочники.Организации.ПустаяСсылка() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(нСтр("ru='Параметр ""Организация"" должен быть заполнен'", "ru"));
		Возврат;
	КонецЕсли;	
	// Организация >>
	
	// << Склад 
	ПараметрСклад = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Склад"));	
    Склад = ПараметрСклад.Значение;
		
	Если НЕ ПараметрСклад.Использование ИЛИ Склад = Неопределено Тогда		
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(нСтр("ru='Параметр ""склад"" должен быть заполнен'", "ru"));
		Возврат;		
		
	КонецЕсли;
	
	Если НЕ Склад.АХ_СлотовыйУчетПоСкладу Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно сформировать отчет, т.к. склад не является слотовым ");
		Возврат;
		
	КонецЕсли;
	
	МассивКодовУзловТочекХранения = Новый Массив;
	МассивКодовУзловТочекХранения.Добавить(Склад.АХ_КодУзлаТочкиХранения);
	
	// Склад >>	
	
	СтруктураОбработкиОшибок = АХ_ОбменВызовСервера.ИнициализироватьСтруктуруОбработкиОшибок();
	
	Прокси = АХ_ОбменВызовСервера.ПолучитьПрокси(СтруктураОбработкиОшибок);
	Если Прокси = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаИдентификаторовXDTO = Прокси.ПолучитьОстаткиНоменклатуры(?(Период = Неопределено,Дата("39991231"),Период),Неопределено,СериализаторXDTO.ЗаписатьXDTO(МассивКодовУзловТочекХранения));
	
	ТаблицаИдентификаторов = СериализаторXDTO.ПрочитатьXDTO(ТаблицаИдентификаторовXDTO);	
	
	КЧ = Новый КвалификаторыЧисла(15,3);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТоваров.Колонки.Добавить("КоличествоОстаток",ОписаниеТиповЧ);
	
	Для Каждого СтрокаТаблицыИдентификаторов из ТаблицаИдентификаторов цикл
		
		НоваяСтрокаТаблицыТоваров = ТаблицаТоваров.Добавить();
		НоваяСтрокаТаблицыТоваров.Номенклатура 				 = АХ_ОбменПравилаЗагрузки.ДесериализоватьСсылкуНаСправочник(СтрокаТаблицыИдентификаторов.Номенклатура,"Номенклатура");
		НоваяСтрокаТаблицыТоваров.ХарактеристикаНоменклатуры = АХ_ОбменПравилаЗагрузки.ДесериализоватьСсылкуНаСправочник(СтрокаТаблицыИдентификаторов.ХарактеристикаНоменклатуры,"ХарактеристикиНоменклатуры");
		НоваяСтрокаТаблицыТоваров.КоличествоОстаток			 = СтрокаТаблицыИдентификаторов.КоличествоОстаток;		
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТоваров.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Склад КАК Склад,
	|	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка) КАК ПроцентИзноса,
	|	ВТ_ТаблицаТоваров.КоличествоОстаток КАК КоличествоФакт,
	|	0 КАК КоличествоУчет
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Организация,
	|	ОстаткиНоменклатурыОстатки.Склад,
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатурыОстатки.ПроцентИзноса,
	|	0,
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&период,
	|			Организация = &Организация
	|				И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Организация КАК Организация,
	|	ВТ_Остатки.Склад КАК Склад,
	|	ВТ_Остатки.Номенклатура КАК Номенклатура,
	|	ВТ_Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Остатки.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ВТ_Остатки.КоличествоФакт) КАК КоличествоФакт,
	|	СУММА(ВТ_Остатки.КоличествоУчет) КАК КоличествоУчет
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.Организация,
	|	ВТ_Остатки.Склад,
	|	ВТ_Остатки.Номенклатура,
	|	ВТ_Остатки.ХарактеристикаНоменклатуры,
	|	ВТ_Остатки.ПроцентИзноса";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("Период", 	    Период);
	Запрос.УстановитьПараметр("Склад",  	    Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Создаем компоновщик макета и получаем макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	СтруктураВнешегоНабора = Новый Структура;
	СтруктураВнешегоНабора.Вставить("ТаблицаТоваров",РезультатЗапроса.Выгрузить());
	
	//Инициализируем процессор компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, СтруктураВнешегоНабора, ДанныеРасшифровки, Истина);
	
	//Очищаем документ результата
	ДокументРезультат.Очистить();
	
	//Выводим отчет в документ
	ПроцессорВывода = Новый
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	
КонецПроцедуры
